In [1]:
import pandas as pd

df = pd.read_csv('ufos.csv')
df.head() # Method to only display the first few rows

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.883056,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.384210,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.200000,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.978333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.418056,-157.803611

In [27]:
# Problem 0
ans0 = df.groupby("shape")["duration (seconds)"].mean()
print(ans0)

shape
changing        926.56000
chevron         311.12500
cigar           821.74074
circle          680.43529
cone            300.00000
cross            60.00000
cylinder       1499.55556
delta         14400.00000
diamond        1140.30000
disk           1143.32895
egg            3088.00000
fireball        346.76562
flash           463.90909
formation      1913.08824
light          1122.00483
other         92593.01449
oval           1425.13559
rectangle       228.58824
sphere      1506267.75385
teardrop        139.71429
triangle        735.29000
unknown        1207.96296
Name: duration (seconds), dtype: float64

In [30]:
# Problem 1
positive_lat = df['latitude'] > 0
positive_long = df['longitude'] > 0

ans1 = df[positive_lat | positive_long].groupby('city')['duration (seconds)'].max()
print(ans1)

city
acton                                         180.00000
addison (i-355 and us 20 (lake st.)           600.00000
adelaide  (south australia)                   300.00000
adelaide (pt. wakefield) (south australia)    600.00000
albany                                        120.00000
                                                ...
yangtzee river (china)                        900.00000
yerevan (armenia)                              60.00000
york                                           30.00000
yuma                                          900.00000
zlatoust (russia)                            1200.00000
Name: duration (seconds), Length: 793, dtype: float64

In [52]:
# Problem 2

ans2 = df.groupby("city")["duration (seconds)"].max().idxmax()

print(ans2)

birmingham (uk/england)

In [63]:
# Problem 3
def comment_word_length(str):
    return len(str.split())

comment_length_series = df["comments"].apply(comment_word_length)
print(comment_length_series)

0       24
1       17
2        6
3       26
4       25
        ..
996     18
997     16
998      8
999     28
1000    10
Name: comments, Length: 1001, dtype: int64